# ДЗ 2, задача 6 «Кешбэк по категории» (★☆☆)
# Главы: 2.4
#
# Банк возвращает часть суммы покупки: на АЗС — 5%, в аптеках — 3%, в супермаркетах — 1%, в
# остальных категориях кешбэка нет. Вводятся категория покупки («азс», «аптека», «супермаркет» или
# другое слово) и сумма покупки — дробное число. Выведите кешбэк с двумя знаками после точки в
# виде «Кешбэк: 75.00 руб.»
#
# Каждый input() выводит подсказку. Тексты подсказок — как в примерах, после двоеточия или скобки
# стоит пробел.
#
# Пример 1
#   ввод:
#     азс
#     1500
#   в терминале:
#     Категория: азс
#     Сумма покупки, руб.: 1500
#     Кешбэк: 75.00 руб.
# Пример 2
#   ввод:
#     аптека
#     849.9
#   в терминале:
#     Категория: аптека
#     Сумма покупки, руб.: 849.9
#     Кешбэк: 25.50 руб.
# Пример 3
#   ввод:
#     супермаркет
#     3270
#   в терминале:
#     Категория: супермаркет
#     Сумма покупки, руб.: 3270
#     Кешбэк: 32.70 руб.
# Пример 4
#   ввод:
#     кафе
#     1200
#   в терминале:
#     Категория: кафе
#     Сумма покупки, руб.: 1200
#     Кешбэк: 0.00 руб.

# Решение

category = input("Категория: ")
summe = float(input("Сумма покупки, руб.: "))

if category == "азс":
    arif_oper = summe / 100 * 5
    print(f"Кэшбэк: {arif_oper:.2f} руб.")
elif category == "аптека":
    arif_oper_1 = summe / 100 * 3 
    print(f"Кэшбэк: {arif_oper_1:.2f} руб.")
elif category == "супермаркет":
    arif_oper_2 = summe / 100 
    print(f"Кэшбэк: {arif_oper_2:.2f} руб.")
else:
    print(f"Кэшбэк: 0.00 руб.")
